
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ОрганизационныйОбъект Тогда
		ЭтаФорма.Заголовок = "Организационный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;  
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.КомплексныйОбъект Тогда
		ЭтаФорма.Заголовок = "Комплексный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ТехническоеМесто Тогда 
		ЭтаФорма.Заголовок = "Техническое место";
		Элементы.ВидОрганизационногоОбъекта.Видимость =  Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ВидОбъектаСтруктурыПриИзмененииНаСервере()
	Если Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ОрганизационныйОбъект Тогда
		ЭтаФорма.Заголовок = "Организационный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;  
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.КомплексныйОбъект Тогда
		ЭтаФорма.Заголовок = "Комплексный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина;
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ТехническоеМесто Тогда 
		ЭтаФорма.Заголовок = "Техническое место";
		Элементы.ВидОрганизационногоОбъекта.Видимость =  Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина ;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидОбъектаСтруктурыПриИзменении(Элемент)
	ВидОбъектаСтруктурыПриИзмененииНаСервере();
КонецПроцедуры

