#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура УсловияВидимости()
	Если Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ОрганизационныйОбъект Тогда
		ЭтаФорма.Заголовок = "Организационный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;  
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.КомплексныйОбъект Тогда
		ЭтаФорма.Заголовок = "Комплексный объект";
		Элементы.ВидОрганизационногоОбъекта.Видимость = Истина;
		Элементы.ВидТехническогоМеста.Видимость = Ложь;
	ИначеЕсли Объект.ВидОбъектаСтруктуры = Перечисления.урскВидыОбъектовСтруктуры.ТехническоеМесто Тогда 
		ЭтаФорма.Заголовок = "Техническое место";
		Элементы.ВидОрганизационногоОбъекта.Видимость =  Ложь;
		Элементы.ВидТехническогоМеста.Видимость = Истина;
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти 

#Область ПриСозданииНовыхНаСервере
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УсловияВидимости()
КонецПроцедуры
#КонецОбласти

#Область ПриИзмененииОбъектаСтруктуры

&НаКлиенте
Процедура ВидОбъектаСтруктурыПриИзменении(Элемент)
	УсловияВидимости();
КонецПроцедуры
 
#КонецОбласти