
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	урскЕдиницыОборудованияНаТехническихМестахСрезПоследних.ТехническоеМесто КАК ТехническоеМесто
	 |ИЗ
	 |	РегистрСведений.урскЕдиницыОборудованияНаТехническихМестах.СрезПоследних(, ) КАК урскЕдиницыОборудованияНаТехническихМестахСрезПоследних
	 |ГДЕ
	 |	урскЕдиницыОборудованияНаТехническихМестахСрезПоследних.ЕдиницыОборудования = &ЕдиницыОборудования";
	Запрос.УстановитьПараметр("ЕдиницыОборудования", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТехническоеМесто = Выборка.техническоеМесто;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

