
Процедура ОбработкаПроведения(Отказ, Режим) 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр урскЕдиницыОборудованияНаТехническихМестах
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата;
	Движение.ТехническоеМесто = ТехническоеМесто;
	Движение.Статус = ВидОперации;
	Движение.ЕдиницыОборудования = ЕдиницаОборудования;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
