#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)  
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата + 1;
	Движение.ЕдиницыОборудования = ЕдиницаОборудования;
	Движение.ТехническоеМесто = НовоеТехническоеМесто;   
	
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата ;
	Движение.ЕдиницыОборудования = " ";
	Движение.ТехническоеМесто = СтароеТехническоеМесто; 
КонецПроцедуры
 #КонецОбласти