
#Область ОбработкаПроведения 

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.урскЗначенияПараметровТехническихМест.Записывать = Истина;
	Для Каждого ТекСтрокаИзмеренныеПараметры Из ИзмеренныеПараметры Цикл
		Движение = Движения.урскЗначенияПараметровТехническихМест.Добавить();
		Движение.Период = Дата;
		Движение.ТехническоеМесто = ТехническоеМесто;
		Движение.Параметр = ТекСтрокаИзмеренныеПараметры.Параметр;
		Движение.Значение = ТекСтрокаИзмеренныеПараметры.Значение;   
		
	КонецЦикла;
КонецПроцедуры    

#КонецОбласти
