#Область ПриИзмененииЕдиницОборудования
&НаСервере
Процедура ЕдиницаОборудованияПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	урскЕдиницыОборудованияНаТехническихМестахСрезПоследних.ТехническоеМесто = &ТехническоеМесто КАК ТехническоеМесто
	 |ИЗ
	 |	РегистрСведений.урскЕдиницыОборудованияНаТехническихМестах.СрезПоследних КАК урскЕдиницыОборудованияНаТехническихМестахСрезПоследних";
	 Запрос.УстановитьПараметр("ЕдиницаОборудования", Объект.ЕдиницаОборудования);
	 Запрос.УстановитьПараметр("период", Объект.Дата);
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Объект.СтароеТехническоеМесто = Выборка.ТехническоеМесто;
	 КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаОборудованияПриИзменении(Элемент)
	ЕдиницаОборудованияПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти